Revit 2027 API
SpecTypeId.ConduitSize Property
 Conduit Size, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ConduitSize { get; }
Public Shared ReadOnly Property ConduitSize As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ConduitSize {
	ForgeTypeId^ get ();
}
static member ConduitSize : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace